const monthNames = {
  "01": "Январь",
  "02": "Февраль",
  "03": "Март",
  "04": "Апрель",
  "05": "Май",
  "06": "Июнь",
  "07": "Июль",
  "08": "Август",
  "09": "Сентябрь",
  10: "Октябрь",
  11: "Ноябрь",
  12: "Декабрь",
};

// Функция, чтобы получить название месяца по строке '2025-04'
function getMonthLabel(ym) {
  const parts = ym.split("-");
  const month = parts[1];
  return monthNames[month] || ym; // если не найдено — вернёт оригинал
}

module.exports = {
  monthNames, // если нужно вручную
  getMonthLabel, // основная функция
};
